{
"totalSpent": "$3.85 trillion",
"budgetCategories": {
    "children": [
        { "name": "National Defense", "value": 595303439435.41 },
        { "name": "International Affairs", "value": 45304204110.79 },
        { "name": "General Science, Space, and Technology", "value": 30230316084.43 },
        { "name": "Energy", "value": 3748706890.45 },
        { "name": "Natural Resources and Environment", "value": 37792268568.36 },
        { "name": "Agriculture", "value": 20174987360.06 },
        { "name": "Transportation", "value": 92940730983.02 },
        { "name": "Community and Regional Development", "value": 21051938355.95 },
        { "name": "Education, Training, Employment, and Social Services",
            "value": 108057798196.10 },
        { "name": "Health", "value": 511320133269.73 },
        { "name": "Medicare", "value": 594535157426.09 },
        { "name": "Income Security", "value": 514582983291.10 },
        { "name": "Social Security", "value": 916077987132.59 },
        { "name": "Veterans Benefits and Services", "value": 174514511683.73 },
        { "name": "Administration of Justice", "value": 57144161860.45 },
        { "name": "General Government", "value": 18639539276.13 },
        { "name": "Net Interest", "value": 240721540897.61 }
    ]
},
"categoryDescriptions": [
        { "name": "National Defense", "value": "This category includes the military activities of the Department of Defense (DOD), the nuclear-weapons related activities of the Department of Energy (DOE) and the National Nuclear Security Administration, the national security activities of several other agencies such as the Selective Service Agency, and portions of the activities of the Coast Guard and the Federal Bureau of Investigation. The programs in this function include: the pay and benefits of active, Guard, and reserve military personnel; DOD operations including training, maintenance of equipment, and facilities; health care for military personnel and dependents; procurement of weapons; research and development; construction of military facilities, including housing; research on nuclear weapons; and the cleanup of nuclear weapons production facilities." },
        { "name": "International Affairs", "value": "This category contains funding for all U.S. international activities, including: operating U.S. embassies and consulates throughout the world; providing military assistance to allies; aiding developing nations; dispensing economic assistance to fledgling democracies; promoting U.S. exports abroad; making U.S. payments to international organizations; and contributing to international peacekeeping efforts. Funding for all of these activities constitutes about one percent of the federal budget. The major agencies in this function include the Departments of Agriculture, State, and the Treasury; the United States Agency for International Development; and the Millennium Challenge Corporation." },
        { "name": "General Science, Space, and Technology", "value": "This category includes the National Science Foundation (NSF), programs at the National Aeronautics and Space Administration except for aviation programs, and general science programs at the Department of Energy (DOE)." },
        { "name": "Energy", "value": "This category contains civilian energy and environmental programs in the Department of Energy (DOE). This function also includes the Rural Utilities Service of the Department of Agriculture, the Tennessee Valley Authority, the Federal Energy Regulatory Commission, and the Nuclear Regulatory Commission. This function does not include DOE's national security activities, which are in the National Defense Function, or its basic research and science activities, which are in General Science, Space and Technology." },
        { "name": "Natural Resources and Environment", "value": "Natural Resources and the Environment. This category includes programs concerned with environmental protection and enhancement; recreation and wildlife areas; and the development and management of the nation's land, water, and mineral resources. It includes programs within the following federal departments and agencies: Agriculture, Commerce, Interior, Transportation, the Army Corps of Engineers, and the Environmental Protection Agency (EPA)." },
        { "name": "Agriculture", "value": "This category includes farm income stabilization, agricultural research, and other services administered by the U.S. Department of Agriculture. The discretionary programs include research and education programs, economics and statistics services, administration of the farm support programs, farm loan programs, meat and poultry inspection, and a portion of the Public Law (P.L.) 480 international food aid program. The mandatory programs include commodity programs, crop insurance, and certain farm loans." },
        { "name": "Transportation", "value": "This category consists mostly of the programs administered by the Department of Transportation, including programs for highways, mass transit, aviation, and maritime activities. This function also includes two components of the Department of Homeland Security: the Coast Guard and the Transportation Security Administration. In addition, this function includes several small transportation-related agencies and the research program for civilian aviation at the National Aeronautics and Space Administration (NASA)." },
        { "name": "Community and Regional Development", "value": "This category includes federal programs to improve community economic conditions, promote rural development, and assist in federal preparations for and response to disasters. This function provides appropriated funding for the Community Development Block Grant, Department of Agriculture rural development programs, the Bureau of Indian Affairs, the Federal Emergency Management Agency, and other disaster mitigation and community development-related programs. It also provides mandatory funding for the federal flood insurance program." },
        { "name": "Education, Training, Employment, and Social Services",
        "value": "This category includes funding for the Department of Education, social services programs within the Department of Health and Human Services, and employment and training programs within the Department of Labor. It also contains funding for the Library of Congress and independent research and art agencies such as the Corporation for Public Broadcasting, the Smithsonian Institution, the National Gallery of Art, the John F. Kennedy Center for the Performing Arts, the National Endowment for the Arts, and the National Endowment for the Humanities." },
        { "name": "Health", "value": "This category includes most direct health care services programs. Other health programs in this function fund anti-bioterrorism activities, national biomedical research, protecting the health of the general population and workers in their places of employment, providing health services for under-served populations, and promoting training for the health care workforce. Some of the agencies funded in this function include the National Institutes of Health (NIH), Centers for Disease Control and Prevention, Health Resources and Services Administration, and the Food and Drug Administration. The major mandatory programs in this function are Medicaid, the State Children's Health Insurance Program (SCHIP), federal and retirees' health benefits, and health care for Medicare-eligible military retirees." },
        { "name": "Medicare", "value": "The Medicare program provides health insurance to senior citizens and persons with disabilities. Congress provides an annual appropriation for the costs of administering and monitoring the Medicare program. Nearly 99 percent of spending in this function occurs on the mandatory side of the budget, and almost all of the mandatory spending consists of payments for Medicare benefits." },
        { "name": "Income Security", "value": "This category consists of a range of income security programs that provide cash or near-cash assistance (e.g., housing, nutrition, and energy assistance) to low-income persons, and benefits to certain retirees, persons with disabilities, and the unemployed. Housing assistance programs account for the largest share of discretionary funding in this function. Major federal entitlement programs in this function include unemployment insurance, trade adjustment assistance income support, food stamps, Temporary Assistance to Needy Families, foster care, and Supplemental Security Income. Federal and other retirement and disability programs comprise approximately one third of the funds in this function." },
        { "name": "Social Security", "value": "This category consists of the two payroll tax-financed programs that are collectively known as Social Security: Old-Age and Survivors Insurance and Disability Insurance (OASDI). This function includes Social Security benefit payments and funds to administer the program." },
        { "name": "Veterans Benefits and Services", "value": "This category covers the programs of the Department of Veterans Affairs (VA), including veterans' medical care, compensation and pensions, education and rehabilitation benefits, and housing programs. It also includes the Department of Labor's Veterans' Employment and Training Service, the United States Court of Appeals for Veterans Claims, and the American Battle Monuments Commission. Almost 90 percent of appropriated funding in this function goes to veterans' health care." },
        { "name": "Administration of Justice", "value": "This category consists of federal law enforcement programs, litigation and judicial activities, correctional operations, and state and local justice assistance. Agencies within this function include: the Federal Bureau of Investigation; the Drug Enforcement Administration; Border and Transportation Security; the Bureau of Alcohol, Tobacco, Firearms and Explosives; the United States Attorneys; legal divisions within the Department of Justice; the Legal Services Corporation; the federal Judiciary; and the Federal Bureau of Prisons. This function includes several components of the Department of Homeland Security." },
        { "name": "General Government", "value": "This category includes the activities of the White House and the Executive Office of the President, the legislative branch, and programs designed to carry out the legislative and administrative responsibilities of the federal government, including personnel management, fiscal operations, and property control." },
        { "name": "Net Interest", "value": "This category consists primarily of the interest paid by the federal government to private and foreign government holders of U.S. Treasury securities. This amount is slightly offset by interest income received by the federal government on loans and cash balances and by earnings of the National Railroad Retirement Investment Trust." }
],
"budgetBreakdown": {
        "totalContractors": "2.29 trillion",
        "individuals": 30.2,
        "stateLocal": 17,
        "contractors": 12.1,
        "federalGov": 40.5
    },
"treemapColors": [
        "#1b4956",
        "#1d545c",
        "#1d545c",
        "#1f5f63",
        "#216a69",
        "#227570",
        "#238076",
        "#238c7d",
        "#239884",
        "#32a387",
        "#48ae87",
        "#5aba87",
        "#6ac587",
        "#79d086",
        "#87dc85",
        "#95e784",
        "#a3f383"
    ]
}